from django.shortcuts import render
from django.http import JsonResponse
from rest_framework.response import Response
from rest_framework.decorators import api_view
from rest_framework import status
from .serializers import TodolistSerializer
from .models import Todolist

# GET Data
@api_view(['GET']) # 'GET' --> ดึงข้อมูล
def all_todolist(request):
    alltodolist = Todolist.objects.all() # ดึงข้อมูลจาก model Todolist --> "SELECT * FROM todolist"
    serializer = TodolistSerializer(alltodolist, many=True) # many=True --> มีจำนวนที่ส่งไปมากกว่า 1 ตัว
    return Response(serializer.data, status=status.HTTP_200_OK) # status=status.HTTP_200_OK --> โค้ดรหัสที่จะส่งออกไป

# POST Data => สร้างข้อมูลใหม่
@api_view(['POST']) # 'POST' --> sava data to database
def post_todolist(request):
    if request.method == 'POST':
        serializer = TodolistSerializer(data=request.data)
        if serializer.is_valid(): # ส่งข้อมูลถูกต้อง จะทำการบันทึกและส่งค่า
            serializer.save()
            return Response(serializer.data, status=status.HTTP_201_CREATED)
        return Response(serializer.errors, status=status.HTTP_404_NOT_FOUND) # ส่งข้อมูลไม่สำเร็จ จะส่งค่า error ไปให้

# PUT Update => เอาข้อมูลมาอัปเดต
@api_view(['PUT'])
def update_todolist(request, TID):
    # localhost:8000/api/update-todolist/.... => ส่ง id ที่ทำการแก้ไขข้อมูล
    todo = Todolist.objects.get(id=TID)

    if request.method == 'PUT':
        data = {}
        serializer = TodolistSerializer(todo, data=request.data)
        if serializer.is_valid():
            serializer.save()
            data['status'] = 'updated'
            return Response(data=data, status=status.HTTP_201_CREATED)
        return Response(serializer.error, status=status.HTTP_404_NOT_FOUND)

# DELETE => ลบข้อมูล
@api_view(['DELETE'])
def delete_todolist(request,TID):
    todo = Todolist.objects.get(id=TID)

    if request.method == 'DELETE':
        delete = todo.delete()
        data = {}
        if delete:
            data['status'] = 'deleted'
            statuscode = status.HTTP_200_OK
        else:
            data['status'] = 'failed'
            statuscode = status.HTTP_400_BAD_REQUEST
        return Response(data=data, status=statuscode)

data = [
    {
        "title":"--- ประวัติความเป็นมาของสุนัข ---",
        "subtitle":"สุนัขป่าตัวแรกนั้น เกิดขึ้นเมื่อ 31,700 ปีก่อน ก่อนอพยพข้ามถิ่นและทวีปต่างๆ ทำให้สุนัขหลากหลายสายพันธุ์ถือกำเนิดขึ้น",
        "image_url":"https://raw.githubusercontent.com/pattama39/FlutterAPI/main/dog.jpg",
        "detail":"\n\nสุนัขมีต้นกำเนิดมาจากมนุษย์แถบขั้วโลกเหนือนำ มันมาเลี้ยงเมื่อประมาณ 12,000 ปีที่แล้วแล้ว เชื่อกันว่า สุนัขป่าตัวแรกนั้น เกิดขึ้นเมื่อ 31,700 ปีก่อน การอพยพข้ามถิ่น\n\nและทวีปต่างๆ ทำให้สุนัขหลากหลายสายพันธุ์กำเนิดขึ้น\n\nสุนัขพันธุ์ที่เรียกได้ว่าเป็นสุนัขพันธุ์ต้นตระกูลคือพันธุ์สุนัขไซบิ เรียนหรือหมาป่าที่มีอยู่อย่างแพร่หลายในปัจจุบัน ต่อมามีสุนัขป่าอีกพันธุ์หนึ่งที่มนุษย์นำมากินมีชื่อภาษาละตินว่า เคนิสลูปัส (Canis lupus) ซึ่งแปลว่าสุนัขป่า สุนัขป่าชนิดนี้จะเชื่องกว่าสุนัขธรรมดา \n\nมีขนยาว หางเป็นแผง กระดูกแก้มโหนก และหางของมันจะเห็นชัดมากขึ้น มีนิสัยรักอิสระกว่าสุนัขป่า\n\nการค้นคว้าวิจัยและศึกษาเรื่องราวของสุนัข ได้มีขึ้นในประเทศอังกฤษ ในแถบยุโรปและอเมริกา แล้วจึงแพร่หลายไปในส่วนต่าง ๆ ของโลก ในสหรัฐอเมริกาได้มีการจัดตั้งเป็นสมาคมผู้เลี้ยงสุนัขขึ้นในปี ค.ศ. 1 สุนัขพันธุ์แท้ชนิดแรกที่ได้จดทะเบียนในสหรัฐอเมริกาคือ สุนัขพันธุ์อิงลิชเชสเตอร์กริว ในประเทศอังกฤษได้มีการรวบรวมกันตั้งสมาคมผู้เลี้ยงสุนัขขึ้นเช่นกันในปี ค.ศ. 1859 (พ.ศ. 2402) ในครั้งแรกสมาคมนี้ได้รับรองให้จดทะเบียนสุนัขพันธุ์แท้ได้ 40 สายพันธุ์ และได้จัดวิธีการสุนัขพันธุ์ต่าง ๆ เพื่อความเหมาสมอีกหลายครั้ง ในปี ค.ศ. 1881 (พ.ศ. 2424) สมาคมนี้ได้ให้การรับรองพันธุ์แท้ต่างๆ รวมเป็นจำนวน 46 พันธุ์ การแก้ไขเพิ่มเติมการรับรองเป็นสุนัขพันธุ์แท้เป็นครั้งสุดท้าย เมื่อปี ค.ศ. 1974 (พ.ศ. 2417) ได้มีสุนัขที่ให้การรับรองทั้งหมด 120 กว่าสายพันธุ์"
    },
    {
        "title":"--- ประวัติความเป็นมาของแมว ---",
        "subtitle":"แมวถือกำเนิดขึ้นกว่า 50 ล้านปีมาแล้ว เป็นสัตว์เลี้ยงลูกด้วยนมและกินเนื้อเป็นอาหาร เรียกว่า Miacis",
        "image_url":"https://raw.githubusercontent.com/pattama39/FlutterAPI/main/cat.jpg",
        "detail":"\n\nแมว หรือชื่อทางวิทยาศาสตร์ว่า Felis Catus มีกำเนิดขึ้นบนโลกมากกว่า 50 ล้านปีมาแล้ว นัีกชีววิทยาค้นพบว่าบรรพบุรุษของแมวถือกำเนิดขึ้นกว่า 50 ล้านปีมาแล้ว เป็นสัตว์เลี้ยงลูกด้วยนมและิกินเนื้อเป็นอาหาร เรียกว่า Miacis และได้วิวัฒนาการจนเริ่มมีลักษณะคล้ายแมวเมื่อ 10 ล้านปีก่อน ขนาดและรูปร่างใกล้เคียงกับแมวป่าที่มีเขี้ยวขนาดใหญ่เรียกว่า Dinistis\n\nในความจริงแล้วนั้นแมวบ้านมีต้นตระกูลที่แยกออกมาจากเสือไซบีเรียน และแมวพื้นเมืองต่าง ๆ ปัจจุบันสายพันธุ์แมว (รวมทั้งสิงโตและเสือต่าง ๆ ) มีทั้งหมดถึง 36 ตระกูล 51 ชนิด"
    },
    {
        "title":"--- ประวัติความเป็นมาของกระต่าย ---",
        "subtitle":"กระต่ายโดยธรรมชาติ เป็นสัตว์ที่อยู่สุดปลายของห่วงโซ่อาหาร ด้วยเป็นอาหารของสัตว์กินเนื้อชนิดต่าง ๆ",
        "image_url":"https://raw.githubusercontent.com/pattama39/FlutterAPI/main/rabbit.jpg",
        "detail":"\n\nกระต่าย (อังกฤษ: Hare, Rabbit) จัดอยู่ในไฟลัมสัตว์มีแกนสันหลัง ชั้นสัตว์เลี้ยงลูกด้วยนม อันดับกระต่าย (Lagomorpha) ในวงศ์ Leporidae\n\nกระต่ายแม้จะมีฟันแทะเหมือนกับสัตว์ฟันแทะ (Rodentia) แต่ถูกจัดออกมาเป็นอันดับต่างหาก เนื่องมีจำนวนฟันที่ไม่เท่ากัน เพราะกระต่ายมีฟันแทะที่ขากรรไกรบน 2 แถว เรียงซ้อนกันแถวละ 2 ซี่ ฟันกรามบนข้างละ 6 ซี่ และฟันกรามล่างข้างละ 5 ซี่ เมื่อเวลาเคี้ยวอาหาร กระต่ายจะใช้ฟันทั้ง 2 ด้านเคี้ยวสลับกันไป ต่างจากสัตว์ฟันแทะโดยทั่วไปที่เคี้ยวเคลื่อนหน้าเคลื่อนหลัง ซึ่งสามารถเขียนเป็นสูตรได้ว่า  (1\tfrac{2}{2},C\tfrac{0}{0},P\tfrac{3}{2},M\tfrac{2}{3}) X 2 = 28\n\nกระต่ายเป็นสัตว์เลี้ยงลูกด้วยนมที่มีขนาดเล็ก มีขนปุกปุยทั่วลำตัว มีหางกลมสั้น มีใบหูยาวเมื่อเทียบกับสัตว์อื่น ซึ่งวิวัฒนาการมาใช้สำหรับฟังเสียงได้เป็นอย่างดี และยังมีประสาทสัมผัสในการดมกลิ่นที่ดีมาก กระต่ายมีขาหน้าที่มี 5 นิ้ว ขาหลังมี 4 นิ้ว มีสะโพกที่ยาวและทรงพลัง เต็มไปด้วยกล้ามเนื้อ จึงสามารถกระโดดได้เป็นอย่างดี ใต้ฝ่าเท้ามีขนนุ่ม ๆ รองรับอยู่ เพื่อมิให้เกิดเสียงเมื่อเคลื่อนไหว เป็นสัตว์ที่ตื่นตกใจง่ายและมีความว่องไวปราดเปรียวมากในการระแวดระวังภัย นอกจากนี้แล้วตาของกระต่ายยังมีหนังตาหรือเปลือกตาถึง 3 ชั้นด้วยกัน"
    },
    {
        "title":"--- ประวัติความเป็นมาของเต่า ---",
        "subtitle":"เต่าเป็นสัตว์ที่มีชื่อเสียงมาตั้งแต่ครั้งโบราณ มีหลายความเชื่อในโลกนี้ที่มีตำนานว่า เต่ากำเนิดขึ้นมานับแต่สร้างโลก",
        "image_url":"https://raw.githubusercontent.com/pattama39/FlutterAPI/main/turtle.jpg",
        "detail":"\n\nท่านผู้อ่านบางท่านอาจจะเคยตกใจจนต้องเหยียบเบรกรถจนตัวโก่ง ทั้งที่กำลังขับอยู่ในบริเวณวัด เพราะบังเอิญมีเต่าตัวน้อยๆ กำลังคลานข้ามถนน\n\nปัจจุบันนี้มีเต่าถูกนำไปปล่อยที่วัดจำนวนมาก ด้วยความเชื่อที่ว่า จะทำให้อายุยืนเหมือนกับเต่า ซึ่งเป็นสัตว์ที่ขึ้นชื่อเรื่องอายุยาวนานแต่การปล่อยเต่าจะได้บุญจริงหรือ??\n\nก่อนจะไปถึงขั้นนั้น ไทยรัฐ ซันเดย์ สเปเชียล โดยทีมงานต่วย-ตูน จะขอพาท่านผู้อ่านไปรู้จักกับเจ้าตัวนุ่มนิ่มที่แบกกระดองไปไหนต่อไหนอย่างช้าๆตัวนี้เสียก่อน\n\nเต่าเป็นสัตว์ที่มีชื่อเสียงมาตั้งแต่ครั้งโบราณ มีหลายความเชื่อในโลกนี้ที่มีตำนานว่า เต่ากำเนิดขึ้นมานับแต่สร้างโลก มีเรื่องเล่าของชาวอินเดียโบราณว่า โลกบูดๆเบี้ยวๆที่เราอาศัยอยู่นี้ ที่แท้แล้วตั้งอยู่บนหลังเต่ายักษ์ตัวมหึมา เต่าจึงเป็นสัตว์ที่รับภาระหนัก เพราะต้องแบกโลกเอาไว้ทั้งใบ (มนุษย์เดินดินคนไหนที่เจอปัญหาหนักอก แล้วคิดว่าเรานี่หนอ ทุกข์หนักเหมือนแบกโลกไว้ทั้งโลก จนแทบจะทนอยู่ไม่ไหว ก็คงจะต้องอายเต่า เพราะแบกโลกมานานตั้งแต่ดึกดำบรรพ์ แต่ไม่เคยบ่นเลยสักคำ)"
    },
    {
        "title":"--- ประวัติความเป็นมาของกระรอก ---",
        "subtitle":"กระรอกเป็นสัตว์เลี้ยงลูกด้วยน้ำนม มีขนาดลำตัวเล็ก ขนปุยปกคลุมทั่วทั้งร่ายกายอันน้อยๆของมัน",
        "image_url":"https://raw.githubusercontent.com/pattama39/FlutterAPI/main/squirrel.jpg",
        "detail":"\n\nกระรอก(Squirrel) เป็นสัตว์เลี้ยงลูกด้วยน้ำนม มีขนาดลำตัวเล็ก ขนปุยปกคลุมทั่วทั้งร่ายกายอันน้อยๆของมัน นัยตากลมโต มีหางเป็นพวงฟู จัดอยู่ในประเภทสัตว์ฟันแทะ\n\nวงศ์กระรอกมี วงศ์ย่อย 2 วงศ์ คือ Pteromyinae ได้แก่ กระรอกบิน และวงศ์ Sciurinae ได้แก่ กระรอกต้นไม้, กระรอกบิน, ชิพมั้งค์ สำหรับการเลี้ยงกระรอกทั้งสองชนิดนั้นก็ไม่มีอะไรแตกต่างกันมากครับ\n\nกระรอกต้นไม้ เป็นกระรอกที่มักพบเห็นได้บ่อยๆและคุ้นเคยกันเป็นอย่างดี มีหางยาวเป็นพวงสวยงาม มีกรงเล็บแหลมคมมากๆ และมีใบหูใหญ่กว่าชนิดอื่นๆ บางชนิดมีปอยขนที่หู ส่วนกระรอกบินนั้น จะมีพังผืดข้างลำตัว สำหรับกางเพื่อร่อนจากจุดหนึ่งไปยังอีกจุดหนึ่ง มักเป็นการหากินในตอนกลางคืน มีตาสะท้อนแสงไฟ กระรอกดิน มักจะมีรูปร่างสั้น และล่ำสันกว่ากระรอกต้นไม้ทั่วไปเล็กน้อย มีขาหน้าแข็งแรงใช้สำหรับการขุดดิน หางของกระรอกดินนั้นจะสั้นกว่าหางของกระรอกต้นไม้ และไม่ฟูเป็นพวงนัก และเช่นเดียวกับสัตว์ฟันกัดแทะชนิดอื่น ๆ กระรอกจะมีนิ้วเท้าหลังข้างละ 5 นิ้ว และ นิ้วเท้าหน้าข้างละ 4 นิ้ว ตรงส่วนที่น่าจะเป็นนิ้วโป้งจะกลายเป็นปุ่มนูน ๆ ซึ่งถูกพัฒนาให้เหมาะสำหรับจับอาหารมาแทะ\n\nกระรอกมีขนาดใหญ่เล็กต่าง ๆ กันไปตามสายพันธุ์ และสามารถแบ่งตามขนาดได้ 3 กลุ่ม\n\nคือ ขนาดใหญ่ เช่น พญากระรอก ซึ่งมีขนาดใหญ่ที่สุดในเมืองไทยพบอยู่เพียง 2 ชนิด คือ พญากระรอกดำ (Ratufa bicolor) และพญากระรอกเหลือง (Ratufa affinis) ซึ่งได้ถูกขึ้นบัญชีเป็นสัตว์ป่าคุ้มครอง ขนาดกลาง เช่น กระรอกหลากสี (Callosciurus finlaysoni) กระจ้อน (Menetes berdmorei) และ ขนาดเล็ก เช่น กระเล็น (กระถิก) ซึ่งเป็นกระรอกที่เล็กที่สุดที่พบในประเทศไทย"
    },
    {
        "title":"--- ประวัติความเป็นมาของนกแก้วมาคอร์ ---",
        "subtitle":"นกมาคอร์ หรือที่นิยมเรียกกันว่า นกแก้วมาคอร์ จัดเป็นนกในตระกูลปากขอที่มีขนาดใหญ่นิยมเลี้ยงกันมากหรือจะมากที่สุดก็ว่าได้",
        "image_url":"https://raw.githubusercontent.com/pattama39/FlutterAPI/main/macaw.jpg",
        "detail":"\n\nนกมาคอร์ หรือที่นิยมเรียกกันว่า นกแก้วมาคอร์ จัดเป็นนกในตระกูลปากขอที่มีขนาดใหญ่นิยมเลี้ยงกันมากหรือจะมากที่สุดก็ว่าได้ โดยเฉพาะมีสีสันที่สวยงาม สด ฉูดฉาด ใครพบเห็นจะหลงเสน่ห์แทบทั้งสิ้นในท่าทางที่สุดเชื่องและการพูดจาเลียนเสียงคนนั่นเอง\n\nนกแก้วมาคอว์ถือเป็นนกแก้วที่มีขนาดใหญ่ที่สุด มีถิ่นกำเนิดในแม็กซิโกและอเมริกาใต้ มีสีสันสวยงาม มีเสียงร้องที่ดังมากจงอยปากจะใหญ่เป็นพิเศษ เหนือปากด้านบนจะมีสีขาวเส้นเล็กๆคาดระหว่างปากกับหัว บนหัวมีขนสีเขียวสดและสีฟ้า ดวงตามีขนเป็นลายเส้นดำ 4-5 เส้น ขนบริเวณคอจนถึงหน้าอกเป็นสีเหลืองเข้มและขนหางมีสีแดงสด ขาสั้นใหญ่ แข็งแรง ขนที่ปีกบางทีก็เป็นสีฟ้าและสีเหลืองหรือสีเขียวเหลือง ขนาดของนกมาคอว์มีขนาดตั้งแต่ 32 นิ้ว-35 นิ้ว\n\nสำหรับอาหารของมาคอว์ชอบกินอาหารจำพวกผลไม้ทั่วๆไปและเมล็ดธัญพืช ชอบอยู่กันเป็นฝูง รวมกันเป็นครอบครัวใหญ่ ส่งเสียงดัง ในฤดูผสมพันธุ์จะจับคู่กัน แบบคู่ใครคู่มันและไปสร้างรังตามต้นไม้ใหญ่เพื่อวางไข่ วางไข่ครั้งละ 3-4 ฟอง ใช้เวลาฟักไข่ 30-35 วัน ขนของลูกนกจะขึ้นหลังจาก 3 สัปดาห์และขึ้นจนเต็มตัวและมีสีสันสวยงาม ลูกนกจะแข็งแรงเต็มที่เมื่ออายุสามเดือน ในระหว่างที่ยังเล็กต้องอาศัยอาหารจากแม่นกที่นำมาป้อน โดยจะใช้ปากจิกกินอาหารจากปากแม่ของมัน จนกระทั่งลูกนกสามารถช่วยตนเองได้และในที่สุดมันก็จะบินและหาอาหารเองโดยไม่ต้องอาศัยพ่อแม่ของมัน\n\nมาคอว์จัดเป็นนกที่สามารถฝึกให้เชื่อง เป็นนกที่มีความจำดีและมีความพยาบาทรุนแรง ดุร้าย น่ากลัวมากเท่ากับความอ่อนโยนอ่อนน้อมน่ารักชวนให้ปราณีของมัน โดยอุปนิสัยแล้วมาคอว์เป็นนกที่ชอบสะอาด หากผู้เลี้ยงอาบน้ำให้มันเป็นประจำ มาคอว์จะมีความสุขมาก ดังนั้นผู้เลี้ยงควรใช้น้ำจากฝักบัวรดให้นกได้อาบน้ำบ่อยครั้ง ในฤดูฝนควรอาบน้ำให้ในกลางแจ้ง เพื่อให้นกได้อาบน้ำฝนบ้าง แล้วควรนำนกมาไว้ในที่มีแดดดอนๆและอากาศบริสุทธิ์ มาคอว์เป็นนกที่ไม่ชอบอยู่โดดเดี่ยวเช่นเดียวกับนกแก้วชนิดอื่นๆ\n\nมาคอว์ที่ได้รับการเลี้ยงดูเป็นอย่างดีจะสนิทสนมกับผู้เลี้ยงอย่างสนิทสนม หากผู้เลี้ยงห่างเหินนกมาคอว์จะโศรกเศร้าแสดงอารมณ์ออกมาอย่างชัดเจน ดังนั้นคนที่เลี้ยงนกมาคอว์ควรจะให้ความสนใจและดูแลอย่างใกล้ชิด นกแก้วมาคอว์เป็น นกที่มีขนาดใหญ่มาก มีปากที่แหลมคม ประสาทตาไวมาก มีความฉลากและน่ารักในตัวของมันเอง เป็นนกที่เชื่องมาก หากเจ้าของเอาใจใส่มัน มันก็จะรักเราเหมือนที่เรารักมัน สามารถสอนให้เล่นจักรยาน สอนกิจกรรมต่าง ๆ ได้แต่ต้องหมั่นฝึกฝนจึงจะเป็น "
    }
]

# Create your views here.
def Home(request):
    # json_dumps_params={'ensure_ascii': False --> api ให้เป็นภาษาไทย
    return JsonResponse(data=data, safe=False, json_dumps_params={'ensure_ascii': False}) 
